# a = input("Введите ваше число: ")
# b = int(a) % 10
# print("Последняя цифра вашего числа: ", b)
# ##############################################
# km = 109
# v = int(input("Введите скорость: "))
# t = int(input("Введите время: "))
# s = v * t
# a = s % km
# print(a)
# #############################################
# x = float(input("Введите число: "))
# print(x)
# y = x - int(x)
# print(y)
# #########################################
x = float(input("Введите число: "))
print(int(x*10)%10)
# ######################################
# n = float(input("Введите n: "))
# m = float(input("Введите m: "))
# print(n/m)
# ########################################
# a = int(input("Введите цену в руб: "))
# b = int(input("Введите цену в коп: "))
# n = int(input("Введите количество пирожков: "))
# print(a*n + (b*n/100))
# price = (a*n + (b*n/100))
# print(int(price), ' rub', int((price-int(price))*100), ' kop')
# #################################################
# a = int(input("Введите кол-во метров на подъем за день: "))
# b = int(input("Введите кол-во метров на спуск за ночь: "))
# h = int(input("Введите длину шеста: "))
# print(h/(a-b))
####################################################
# ok = int(input("Введите трехзначное число: "))
# ok1 = ok // 100
# ok2 = (ok % 100) // 10
# ok3 = (ok % 10)
# ok4 = (ok1 + ok2 + ok3)
# print(int(ok4))

# a = int(input("Расстояние по горизонтали: "))
# b = int(input("Расстояние по вертикали: "))
# L = int(input("Левая хрень: "))
# N = int(input("Количество дырок: "))
# r = ((N-1)*a) + ((N-2)*b) + (2*L)
# print(r)
